["```py\n###Prompt\nExtract entities from the following sentences without changing original words.\n\n###\nSentence: \" and storage components. 5+ years of experience deliver\ning scalable and resilient services at large enterprise scale, including experience in data platforms including large-scale analytics on relational, structured and unstructured data. 3+ years of experien\nce as a SWE/Dev/Technical lead in an agile environment including 1+ years of experience operating in a DevOps model. 2+ years of experience designing secure, scalable and cost-efficient PaaS services on\nthe Microsoft Azure (or similar) platform. Expert understanding of\"\nDIPLOMA: none\nDIPLOMA_MAJOR: none\nEXPERIENCE: 3+ years, 5+ years, 5+ years, 5+ years, 3+ years, 1+ years, 2+ years\nSKILLS: designing, delivering scalable and resilient services, data platforms, large-scale analytics on relational, structured and unstructured data, SWE/Dev/Technical, DevOps, designing, PaaS services, Microsoft Azure\n###\n\nSentence: \"8+ years demonstrated experience in designing and developing enterprise-level scale services/solutions. 3+ years of leadership and people management experience. 5+ years of Agile Experie\nnce Bachelors degree in Computer Science or Engineering, or a related field, or equivalent alternative education, skills, and/or practical experience Other 5+ years of full-stack software development exp\nerience to include C# (or similar) experience with the ability to contribute to technical architecture across web, mobile, middle tier, data pipeline\"\nDIPLOMA: Bachelors\\nDIPLOMA_MAJOR: Computer Science\nEXPERIENCE: 8+ years, 3+ years, 5+ years, 5+ years, 5+ years, 3+ years\nSKILLS: designing, developing enterprise-level scale services/solutions, leadership and people management experience, Agile Experience, full-stack software development, C#, designing\n###\n\nSentence: \"5+ years of experience in software development. 3+ years of experience in designing and developing enterprise-level scale services/solutions. 3+ years of experience in leading and managing\n teams. 5+ years of experience in Agile Experience. Bachelors degree in Computer Science or Engineering, or a related field, or equivalent alternative education, skills, and/or practical experience.\"\n```"]