["```py\nAct as a **{{Relevant Professional}}**. \nI want to **{{Problem to Solve}}**\n\nYou will ask me 10 questions, one at the time.\nAfter each question you will wait for my answer, after my answer you\nwill ask the next question. When all the 10 questions\nhave been answered, you will write me the exact steps\nI have to do to solve my problem\n```", "```py\nAct as a **professional gardener**. I want to **renew a front garden that\nis in a pretty bad shape, but I don't know where to start**.\n\nYou will ask me 10 questions, one at the time. After each question you \nwill wait for my answer, after my answer you will ask the next question.\nWhen all the 10 questions have been answered, you will write me the exact\nsteps I have to do to solve my problem.\n```", "```py\n**Question 1**\n*GPT-4*: What is the size of your garden area?\n*Andrea*: It's around 15 squares meters. There is an area that has a weed lawn, and another area that has tiles. i only want to renew the weedy lawn, which is 15 squares meters. In that area I also have a cherry tree\n\n**Question 2**\n*GPT-4*: Could you describe the condition of the soil? Is it sandy, loamy, clayey? And do you know the pH level of your soil?\n*Andrea*: It's loamy. I have no idea about the ph\n\n**Question 3**\n*GPT-4*: Do you have a preference for a certain type of plants or a specific look you want for your garden? For instance, do you want flowering plants, ornamental grasses, shrubs, perennials, or annuals?\n*Andrea*: In the side I want to plant a periennals, the most part would be grass. I'd like to have some plants around the cherry tree, and a hedge on the front of the garden (the part that sees the street)\n\n**Question 4**\n*GPT-4*: What is the sunlight situation in your garden? Does it receive full sunlight, partial sun, or is it mostly in the shade?\n*Andrea*: Full sun, besides the area under the tree that is mostly in shade\n\n**Question 5**\n*GPT-4*: For the hedge, do you have any particular preferences for height, thickness, and color (green, variegated, etc.)?\n*Andrea*: Green High plants\n\n**Question 6**\n*GPT-4*: Could you tell me a bit more about your local climate? For instance, where are you located and what kind of temperatures, rainfall, and seasons do you experience?\n*Andrea*: I live in Ireland, it rains quite a lot, but there is some level of sun almost every day.\n\n**Question 7**\n*GPT-4*: Do you have a preference in terms of maintenance? Would you prefer a low-maintenance garden or are you comfortable with investing a bit more time in upkeep?\n*Andrea*: I'm comfortable in investing some time\n\n**Question 8**\n*GPT-4*: What is the main purpose of this garden? Is it mainly for aesthetics, to create a private space, to attract wildlife, or maybe for growing fruits and vegetables?\n*Andrea*: Aesthetic, but I also want to support pollinators \n\n**Question 9**\n*GPT-4*: What's your budget for this project? This will help determine what type of plants, grass, and amendments you can afford.\n*Andrea*: 500 euro\n\n**Question 10**\n*GPT-4*: Lastly, do you have any known allergies to specific plants, trees, or flowers that we should avoid including in your garden?\n*Andrea*: No\n```", "```py\nStep 1: Clear the Area and Check the Soil\nStart by removing the weeds and any other debris from the area.\nTo check the pH of your soil, you can purchase an inexpensive soil\ntesting kit from your local garden center or online.\nLoamy soil is typically around neutral but knowing the exact pH will help you\nchoose the best plants.\n\nStep 2: Improve the Soil\nBased on your soil test results, you may need to add amendments to your soil\nto improve its fertility. For loamy soil, adding compost or well-rotted\nmanure can improve its nutrient content.\n\nStep 3: Plan Your Plantings\nYou mentioned you wanted a hedge, grass, perennials, and plants around\nthe cherry tree. Here are some suggestions:\n\n    Hedge: Yew (Taxus baccata) can make a good, tall green hedge.\nIt's evergreen and can handle Ireland's wet climate.\n\n    Grass: Ryegrass is durable and can handle full sun and frequent rain.\n    Perennials for sunny areas: Consider Lavender, Sedum, and Echinacea.\nThese will attract pollinators and can handle full sun.\n\n    Plants for the shaded area under the cherry tree: Ferns and hostas\nare shade-loving and will add some texture and visual interest.\n\nStep 4: Purchase and Plant\nPurchase your chosen plants, keeping your budget in mind. Start planting with\nthe hedge, as it will be your primary structural element. After that,\nplant the grass, then your perennials, and finally, the shade-loving plants\naround the cherry tree.\n\nStep 5: Water and Care\nAfter planting, water everything well. Remember that new plants will need\nmore frequent watering until they establish. After they are established,\nadjust watering based on the weather and the needs of each type of plant.\nIn general, the grass will likely need watering once a week, the hedge\nevery 1-2 weeks, and the perennials every 1-2 weeks, but adjust as needed.\nThe plants under the cherry tree will likely need less water due to the\nshade and potential rain protection from the tree.\n\nStep 6: Ongoing Maintenance\nMow the grass as needed, trim the hedge to maintain its shape and height,\nand prune the perennials after flowering to encourage new growth.\nRemove any fallen leaves or debris regularly to keep the garden tidy.\n\nRemember, gardening is a process, and it's okay if everything doesn't\nlook perfect right away. Over time, as the plants grow and fill in,\nyou'll see your garden transform into a beautiful, pollinator-friendly\nspace. Enjoy the process and the result!\n```", "```py\n**AI:** 1\\. Can you provide specific examples of \n how you have maintained a good performance over the past 5 years?\n**Andrea AI:** Certainly! Over the past 5 years, I have consistently delivered high-quality software solutions on time and within budget. I have received positive feedback from clients and colleagues on my ability to understand and meet their requirements effectively. Additionally, I have actively participated in team collaborations, contributing valuable ideas and solutions to complex problems. My performance evaluations have consistently been positive, highlighting my strong work ethic, attention to detail, and ability to adapt to changing project requirements.\n\n**AI:** 2\\. Have you taken on any additional responsibilities \n or projects beyond your initial job description during these 5 years?\n**Andrea AI:** Yes, I have taken on additional responsibilities and projects beyond my initial job description during these 5 years. I have actively sought out opportunities to expand my skill set and contribute to the company's success. For example, I have volunteered to mentor junior engineers, providing guidance and support in their professional development. I have also taken the initiative to lead cross-functional teams on critical projects, demonstrating my ability to handle increased responsibilities and manage complex tasks. These additional responsibilities have allowed me to contribute to the company's growth and success while further developing my own expertise.\n\n**AI:** 3\\. How has your performance directly impacted the company's success or bottom line?\n**Andrea AI:** My performance has directly impacted the company's success and bottom line in several ways. First, by consistently delivering high-quality software solutions, I have helped to enhance the company's reputation and client satisfaction. This has resulted in repeat business from existing clients and positive referrals, contributing to revenue growth. Additionally, my ability to meet project deadlines and stay within budget has helped to minimize project overruns and maximize profitability. I have also proactively identified and implemented process improvements, resulting in increased efficiency and cost savings for the company. Overall, my performance has played a significant role in driving the company's success and financial performance.\n\n**AI:** 4\\. Can you provide any evidence or metrics to support your claim of maintaining a good performance?\n**Andrea AI:** Certainly! Here are some evidence and metrics to support my claim of maintaining a good performance:\n    1\\. Performance evaluations: I have consistently received positive performance evaluations from my managers over the past 5 years, highlighting my strong work ethic, technical expertise, and ability to meet project goals.\n    2\\. Client feedback: I have received positive feedback from clients on multiple projects, commending my professionalism, attention to detail, and ability to deliver high-quality software solutions that meet their needs.\n    3\\. Project success rate: I have successfully delivered 95% of the projects assigned to me on time and within budget, demonstrating my ability to effectively manage and execute complex software development tasks.\n    4\\. Team collaboration: I have actively participated in cross-functional team collaborations, contributing valuable ideas and solutions to complex problems. This has resulted in successful project outcomes and positive feedback from team members.\n    5\\. Training and certifications: I have consistently pursued professional development opportunities, obtaining relevant certifications and attending training sessions to enhance my skills and stay updated with the latest industry trends.\n\nThese evidence and metrics highlight my consistent performance and dedication to delivering high-quality work, which has contributed to the success of both individual projects and the overall company.\n\n**AI:** 5\\. Have you researched the current market \n value for your role and level of experience in your industry?\n**Andrea AI:** Yes, I have researched the current market value for my role and level of experience in the industry. I have conducted thorough research and analysis to understand the prevailing salary ranges and compensation packages for software engineers with similar experience, skills, and responsibilities. I have taken into account factors such as industry standards, geographical location, and company size to ensure that my expectations are aligned with the market value. Based on my research, I believe that my skills and experience warrant a fair and competitive compensation package.\n\n**AI:** 6\\. Have you prepared a list of specific \n reasons why you believe you deserve a raise based on your \n performance and contributions to the company?\n**Andrea AI:** Yes, I have prepared a list of specific reasons why I believe I deserve a raise based on my performance and contributions to the company. Here are some key points:\n    1\\. Consistently high-quality work: Over the past 5 years, I have consistently delivered high-quality software solutions, meeting or exceeding client expectations. This has contributed to the company's reputation and client satisfaction.\n    2\\. Meeting project goals: I have a track record of successfully meeting project deadlines and staying within budget. This has helped to minimize project overruns and maximize profitability for the company.\n    3\\. Additional responsibilities: I have voluntarily taken on additional responsibilities beyond my initial job description, such as mentoring junior engineers and leading cross-functional teams. These contributions have added value to the company and its employees.\n    4\\. Process improvements: I have proactively identified and implemented process improvements, resulting in increased efficiency and cost savings. These improvements have positively impacted the company's bottom line.\n    5\\. Positive feedback: I have received positive feedback from clients and colleagues on my professionalism, attention to detail, and ability to deliver results. This feedback demonstrates the value I bring to the company.\n    6\\. Professional development: I have consistently pursued professional development opportunities, obtaining relevant certifications and staying updated with industry trends. This investment in my skills and knowledge directly benefits the company.\n\nBased on these reasons, I believe that my performance and contributions warrant a raise in recognition of my value to the company.\n\n**AI:** 7\\. Have you scheduled a meeting with your manager \n to discuss your request for a raise?\n**Andrea AI:** No, I have not scheduled a meeting with my manager yet to discuss my request for a raise. However, I am planning to request a meeting in the near future to have a conversation about my performance, contributions, and the possibility of a raise. I believe it is important to have a formal discussion with my manager to present my case and provide them with the opportunity to consider my request.\n\n**AI:** 8\\. Have you prepared a well-structured and persuasive \n argument to present during the meeting with your manager?\n**Andrea AI:** Yes, I have prepared a well-structured and persuasive argument to present during the meeting with my manager. My argument highlights my consistent performance, contributions to the company, and the market value for my role and level of experience. Here is an outline of my argument:\n\n    1\\. Opening: Express gratitude for the opportunity to discuss my performance and contributions with my manager.\n    2\\. Recap of performance: Provide a brief summary of my performance over the past 5 years, emphasizing my consistent delivery of high-quality work, meeting project goals, and positive feedback received from clients and colleagues.\n    3\\. Additional responsibilities: Discuss the extra responsibilities I have taken on voluntarily, such as mentoring junior engineers and leading cross-functional teams, and how they have added value to the company.\n    4\\. Process improvements: Highlight the process improvements I have identified and implemented, resulting in increased efficiency and cost savings for the company.\n    5\\. Market value research: Share the research I have conducted on the current market value for my role and level of experience, demonstrating that my expectations are aligned with industry standards.\n    6\\. Financial impact: Discuss how my performance and contributions have directly impacted the company's success and bottom line, providing specific examples of projects, client satisfaction, and cost savings.\n    7\\. Professional development: Highlight my commitment to continuous learning and professional development, emphasizing how it benefits both myself and the company.\n    8\\. Request for a raise: Clearly and confidently state my request for a raise, based on my performance, contributions, and market value.\n    9\\. Closing: Express my commitment to the company and reiterate that my intention is not to leave, but rather to be fairly compensated for my value and contributions.\n\nBy following this well-structured argument, I believe I can effectively present my case and persuade my manager to consider my request for a raise.\n\n**AI:** 9\\. Are you prepared to negotiate and consider \n alternative forms of compensation if a salary increase is not \n immediately possible?\n**Andrea AI:** Yes, I am prepared to negotiate and consider alternative forms of compensation if a salary increase is not immediately possible. While a salary increase would be ideal, I understand that there may be constraints or limitations within the company's budget. In such a case, I am open to discussing alternative forms of compensation that may still provide value and meet my financial needs. This could include options such as performance-based bonuses, stock options, additional paid time off, professional development opportunities, or other benefits that align with my career growth and financial goals. I believe in maintaining open and constructive communication during the negotiation process to find a mutually beneficial solution.\n\n**AI:** 10\\. Have you considered the potential outcomes and next \n steps if your request for a raise is not approved?\n**Andrea AI:** Yes, I have considered the potential outcomes and next steps if my request for a raise is not approved. While I am hopeful that my manager will recognize my contributions and grant the raise, I understand that it may not always be possible due to various factors. In such a scenario, I am committed to maintaining a positive attitude and continuing to perform at a high level in my current role.\n\nIf my request for a raise is not approved, I would seek feedback from my manager on areas of improvement and opportunities for growth within the company. I would also explore other avenues for professional development, such as attending training sessions or pursuing certifications, to enhance my skill set and increase my value to the company.\nAdditionally, I would consider discussing the possibility of a performance-based plan or timeline with my manager, where I can work towards specific goals or milestones that would make me eligible for a raise in the future. This would allow me to have a clear path for advancement and provide an opportunity to revisit the topic of a raise at a later date.\nUltimately, my goal is to continue contributing to the success of the company and growing in my career. If a raise is not immediately possible, I am committed to exploring alternative paths for growth and advancement within the company while keeping an open mind about potential opportunities outside the organization as well.\n```", "```py\n**AI**: Based on your responses, here are the exact steps you can \ntake to address your situation:\n\n    1\\. Schedule a meeting with your manager: Request a \nmeeting with your manager to discuss your performance, \ncontributions, and the possibility of a raise.\n\n    2\\. Present your case: During the meeting, present a \nwell-structured argument that highlights your consistent performance, \nadditional responsibilities, process improvements, \nmarket value research, financial impact, and commitment \nto professional development. Clearly state your request for a \nraise based on these factors.\n\n    3\\. Be open to negotiation: Be prepared to negotiate and \nconsider alternative forms of compensation if a salary increase \nis not immediately possible. Discuss options such as \nperformance-based bonuses, stock options, additional paid time off, \nor professional development opportunities.\n\n    4\\. Seek feedback and growth opportunities: If your request for \na raise is not approved, seek feedback from your manager on areas \nof improvement and opportunities for growth within the company. \nExplore avenues for professional development to enhance your skills \nand increase your value to the company.\n\n    5\\. Discuss a performance-based plan: Consider discussing the \npossibility of a performance-based plan or timeline with your manager, \nwhere you can work towards specific goals or milestones that would make \nyou eligible for a raise in the future. This provides a clear path \nfor advancement and an opportunity to revisit the topic of a \nraise at a later date.\n\n    6\\. Maintain a positive attitude and performance: Regardless \nof the outcome, maintain a positive attitude and continue to \nperform at a high level in your current role. Stay committed to \ncontributing to the success of the company and explore growth opportunities \nwithin or outside the organization.\n\nRemember, it's important to approach the meeting with professionalism, confidence, and a focus on the value you bring to the company. Good luck with your meeting and your pursuit of a raise!\n```"]