["```py\nfrom transformers import CLIPProcessor, CLIPModel\nimport torch\nimport requests\nfrom PIL import Image\n\nmodel = CLIPModel.from_pretrained(\"openai/clip-vit-base-patch32\")\nprocessor = CLIPProcessor.from_pretrained(\"openai/clip-vit-base-patch32\")\n```", "```py\nurl = \"https://images.freeimages.com/images/large-previews/342/green-tree-frog2-1616738.jpg\"\nimage = Image.open(requests.get(url, stream=True).raw)\n\ninputs = processor(text=[\"a photo of a tree frog\", \"a photo of a tailed frog\"], images=image, return_tensors=\"pt\", padding=True)\n\noutputs = model(**inputs)\nlogits_per_image = outputs.logits_per_image  # this is the image-text similarity score\nprobs = logits_per_image.softmax(dim=1)  # we can take the softmax to get the label probabilities\nprint(probs)\n\n\"\"\"\nOutput:\ntensor([[0.3164, 0.6836]], grad_fn=<SoftmaxBackward0>)\n\"\"\"\n```", "```py\nprompts = {\"tree frog\": [\n        \"A tree frog is a small frog that typically has greenish coloration.\",\n        \"A tree frog is a small frog that typically has bright colors, long toes that help it climb, and suction cups on its feet.\",\n        \"A tree frog is small, typically green, frog that lives in trees.\",\n        \"A tree frog looks like a frog with special adaptations for living in trees.\",\n        \"A tree frog is a small, typically green frog with large adhesive pads on its feet that allow it to climb smooth surfaces like glass and plastic.\",\n        \"Tree frogs are small amphibians with big toes that help them climb.\",\n        \" Most tree frogs have bright colors.\",\n        \"Tree frogs are small frogs that live in trees.\",\n        \"A tree frog is a small frog that has large toe pads that help it climb trees.\",\n        \"A tree frog typically has green skin, although some species can be brown, gray, or yellow.\",\n        \"A tree frog is a small frog that lives in trees.\",\n        \"A tree frog is a small, tailless amphibian with large, powerful hind legs and webbed feet.\",\n        \"A tree frog is a amphibian that has well-developed hind legs which enable it to climb trees and other structures.\",\n        \"Avatar of the forest, the tree frog is a small amphibian with big eyes bulging out of its head.\",\n        \"A tree frog is a small amphibian that typically has bright green skin and lives in trees.\",\n        \"A tree frog is a small, slim frog that typically has brightly colored skin.\",\n        \"A tree frog is a small frog that typically has a bright green body and lives in trees.\",\n        \"A tree frog is a small, tailless amphibian that typically has bright green or yellowish skin and lives in trees or near bodies of water.\",\n        \"A tree frog is a small amphibian that typically has a green body and large eyes.\",\n        \"A tree frog is a small frog that typically has bright colors.\",\n        \"The identifying characteristics of a tree frog varies depending on the species, but some common features include large adhesive toes, protruding eyes, and bright colours.\",\n        \"Some identifying characteristics of a tree frog are that they have large toe pads, which help them grip onto tree branches, and their bodies are slim so that they can fit into small spaces.\",\n        \"Tree frogs are small frogs that live in trees and other high places.\",\n        \"The identifying characteristics of a tree frog are its long hind legs, which it uses to jump, and its adhesive pads, which it uses to stick to surfaces.\",\n        \"The identifying characteristics of a tree frog are that they have long, sticky toes that help them climb trees, and they have wrinkled skin that helps them absorb water.\",\n        \"Tree frogs have long, sticky toes that help them climb trees.\",\n        \"Tree frogs are small frogs that can climb trees.\",\n        \"Tree frogs have long hind legs that they use to jump.\",\n        \"There are over 6,300 species of tree frogs, so it is difficult to give one answer to this question.\",\n        \"The identifying characteristics of a tree frog are its long, sticky toes that help it climb trees, and its dark green or brown coloration that helps it blend in with leaves.\"\n    ],\n    \"tailed frog\": [\n        \" short, stout body; webbed hind feet with large, adhesive discs on the toes; long, muscular tail; small eyes located on top of the head; smooth or warty skin; and a small mouth.\",\n        \"A tailed frog has a long, skinny body and a long tail.\",\n        \"A tailed frog has a long, slender body with a tail that is about as long as its body.\",\n        \"A tailed frog is a frog with a long tail.\",\n        \"A tailed frog has a long tail and four legs.\",\n        \"A tailed frog is a small frog that has a long tail.\",\n        \"A tailed frog has a long tail that is often as long as its body.\",\n        \"A tailed frog has a long tail and webbed feet.\",\n        \"A tailed frog is a frog with a long tail.\",\n        \"A tailed frog is a small frog with a long tail.\",\n        \"A tailed frog (Asteriscus species) is a species of frog in the Asteriscidae family.\",\n        \"A tailed frog is a type of frog that has a long tail.\",\n        \"A tailed frog is a frog with a long tail, typically over 10 cm in length.\",\n        \"A tailed frog is a species of frog that has a long tail.\",\n        \"Tailed frogs are a type of frog that have a long tail.\",\n        \"A tailed frog is a type of frog that has a long, tail-like structure protruding from its back.\",\n        \"A tailed frog is a frog that has a long tail.\",\n        \"A tailed frog is a frog that has a long tail.\",\n        \"A tailed frog has a long, thin body with short legs.\",\n        \"A tailed frog is a small amphibian that has a long tail.\",\n        \"Some identifying characteristics of a tailed frog are that they have a long tail, they are good swimmers, and they live near water.\",\n        \"There are over 60 species of tailed frogs, so it is difficult to give a definitive answer.\",\n        \"There are over 100 species of tailed frogs, so it is difficult to give a general answer to this question.\",\n        \"Some identifying characteristics of a tailed frog are that they have a long tail, they are small, and they have webbed feet.\",\n        \"There are over 60 species of tailed frog, so identifying characteristics can vary.\",\n        \"Tailed frogs are a species of frog that are native to the western United States and northern Mexico.\",\n        \"The identifying characteristics of a tailed frog are its tail, which is used for swimming, and its webbed feet.\",\n        \"Tailed frogs are small, dark-colored frogs with long, slender hind legs and a long, thin tail.\",\n        \"Some tailed frogs have a tail that is about one-third the length of their body.\",\n        \"The identifying characteristics of a tailed frog are its long tail and its smooth, moist skin.\"\n    ]}\n```", "```py\n\"\"\"\nFirst of all, we can verify that \noutputs = model(**inputs)\nlogits_per_image = outputs.logits_per_image  # this is the image-text similarity score\nprobs = logits_per_image.softmax(dim=1)  # we can take the softmax to get the label probabilities\nprobs\n\nIs the same as:\nimage_features = model.visual_projection(model.vision_model(inputs['pixel_values']).pooler_output)\ntext_features = model.text_projection(model.text_model(inputs['input_ids']).pooler_output)\nimage_features = image_features / image_features.norm(dim=-1, keepdim=True)\ntext_features = text_features / text_features.norm(dim=-1, keepdim=True)\n\n# cosine similarity as logits\nlogit_scale = model.logit_scale.exp()\nlogits_per_image = logit_scale * image_features @ text_features.t()\nprobs = logits_per_image.softmax(dim=1)\nprobs\n\"\"\"\n\nimage_features = model.visual_projection(model.vision_model(inputs['pixel_values']).pooler_output)\n\ntree_frog_vector = model.text_model(processor(prompts['tree frog'], return_tensors=\"pt\", padding=True)['input_ids']).pooler_output\n# take the mean prompt embedding\ntree_frog_vector = tree_frog_vector.mean(dim=0, keepdims=True)\n# final projection \ntree_frog_vector = model.text_projection(tree_frog_vector)\n\ntailed_frog_vector = model.text_model(processor(prompts['tailed frog'], return_tensors=\"pt\", padding=True)['input_ids']).pooler_output\n# take the mean prompt embedding\ntailed_frog_vector = tailed_frog_vector.mean(dim=0, keepdims=True)\n# final projection\ntailed_frog_vector = model.text_projection(tailed_frog_vector)\n\n# concatenate \ntext_features = torch.cat([tree_frog_vector, tailed_frog_vector], dim=0)\n\n# normalize features\nimage_features = image_features / image_features.norm(dim=-1, keepdim=True)\ntext_features = text_features / text_features.norm(dim=-1, keepdim=True)\n\n# cosine similarity as logits\nlogit_scale = model.logit_scale.exp()\nlogits_per_image = logit_scale * image_features @ text_features.t()\nprobs = logits_per_image.softmax(dim=1)\nprint(probs)\n\n\"\"\"\nOutput:\ntensor([[0.6512, 0.3488]], grad_fn=<SoftmaxBackward0>)\n\"\"\"\n```"]