["```py\nexport OPENAI_API_KEY=sk-t59pgejhtrff5(...)\n```", "```py\nimport os\nimport openai\nimport pandas as pd\n\nopenai.api_key = os.getenv(\"OPENAI_API_KEY\")\n\nl_age = ['18', '20', '30', '40', '50', '60', '90']\nl_gender = ['man', 'woman']\nl_power = ['invisibility', 'read in the thoughts', 'turning lead into gold', 'immortality', 'telepathy', 'teleport', 'flight'] \n\nf_prompt = \"Imagine a complete and detailed description of a {age}-year-old {gender} fictional character who has the superpower of {power}. Write out the entire description in a maximum of 100 words in great detail:\"\nf_sub_prompt = \"{age}, {gender}, {power}\"\n\ndf = pd.DataFrame()\nfor age in l_age:\n for gender in l_gender:\n  for power in l_power:\n   for i in range(3): ## 3 times each\n    prompt = f_prompt.format(age=age, gender=gender, power=power)\n    sub_prompt = f_sub_prompt.format(age=age, gender=gender, power=power)\n    print(sub_prompt)\n\n    response = openai.Completion.create(\n     model=\"text-davinci-003\",\n     prompt=prompt,\n     temperature=1,\n     max_tokens=500,\n     top_p=1,\n     frequency_penalty=0,\n     presence_penalty=0\n    )\n\n    finish_reason = response['choices'][0]['finish_reason']\n    response_txt = response['choices'][0]['text']\n\n    new_row = {\n      'age':age, \n      'gender':gender, \n      'power':power, \n      'prompt':prompt, \n      'sub_prompt':sub_prompt, \n      'response_txt':response_txt, \n      'finish_reason':finish_reason}\n    new_row = pd.DataFrame([new_row])\n    df = pd.concat([df, new_row], axis=0, ignore_index=True)\n\ndf.to_csv(\"out_openai_completion.csv\")\n```", "```py\nimport pandas as pd\nimport openai\nimport subprocess\n\ndf = pd.read_csv(\"out_openai_completion.csv\")\n\nprepared_data = df.loc[:,['sub_prompt','response_txt']]\nprepared_data.rename(columns={'sub_prompt':'prompt', 'response_txt':'completion'}, inplace=True)\nprepared_data.to_csv('prepared_data.csv',index=False)\n\n## prepared_data.csv --> prepared_data_prepared.json\nsubprocess.run('openai tools fine_tunes.prepare_data --file prepared_data.csv --quiet'.split())\n\n## Start fine-tuning\nsubprocess.run('openai api fine_tunes.create --training_file prepared_data_prepared.jsonl --model davinci --suffix \"SuperHero\"'.split())\n```", "```py\nprompt,completion\n\"18, man, invisibility\",\"He looks to be in his late teens, with dark eyes and unruly black hair which reach his shoulders. His build is athletic and strong, but not muscular. He often wears clothing that makes him blend in with his surroundings, in order to stay as inconspicuous as possible.He has the ability of invisibility, which he can use to become an invisible observer or to make himself or objects around him disappear from view. He has honed his skills to make himself undetectable, able to even make sounds vanish, allowing him to go unnoticed. His invisibility power is his greatest asset, and he uses it to protect those he cares about.\"\n\"18, man, invisibility\",\"18 year-old Jackson is a powerful young man with the incredible power of invisibility. He stands at 6'2 and has a strong athletic frame with wavy brown hair, startling blue eyes and a warm and gentle smile. His strength and agility make him especially good at using his ability. He can become invisible in an instant, moving through walls and other obstacles without being detected. What's more, he can move objects with his mind and use his power to protect those he loves. His power is a blessing and a curse, as it can be abused to do harm. Jackson is a brave and noble person who uses his power to do good and make the world a better place.\"\n\"18, man, invisibility\",\"Brandon is an 18-year-old of average build, standing roughly 5'10 with an inquisitive look. He has naturally wavy chestnut brown hair and bright blue eyes. His demeanor is usually quite serious, but he also has an easy and gentle smile. He has a natural gift of invisibility, which he uses to protect himself and his family from harm. He's an inquisitive and creative young man who uses his gift to explore the world, observe people, and uncover the truth. His consistent practice of mindfulness helps him remain unseen, even when his emotions are visible. His intelligence and persistent passion for truth drives him to help those in need.\"\n\"18, man, read in the thoughts\",\"This 18-year-old man has a muscular stature and long, ash blonde hair. His bright blue eyes are full of knowledge and power, hinting at the strange ability he has - he can read minds. Now and then, strange sparks of electricity streak from his eyes when he concentrates hard enough. He is often calm and collected, but when provoked has the ability to blend his learning of your thoughts with his immense strength. His wit, intelligence and empathy are weapons that are often underestimated - yet, very lethal.\"\n\"18, man, read in the thoughts\",\"He's an 18-year-old man with short, cropped dark hair and bright green eyes. His usual outfit consists of an olive green hoodie, blue jeans and purple trainers. He's relaxed, confident and always reads the atmosphere well. One of his great skills is read in the thoughts of others. By doing so, he is able to understand people more easily and relate to their concerns out of the blue. He always uses his superpower with the utmost dignity and respect, never using it to manipulate. He uses it to seek the truth, identify people's emotions and gain insight into their perspectives. He's the sort of person that can make anyone feel comfortable and is never afraid of a challenge. His superpower is merely an extension of his already charismatic disposition.\"\n(...)\n```", "```py\n{\"prompt\":\"18, man, invisibility ->\",\"completion\":\" \\n\\nHe looks to be in his late teens, with dark eyes and unruly black hair which reach his shoulders. His build is athletic and strong, but not muscular. He often wears clothing that makes him blend in with his surroundings, in order to stay as inconspicuous as possible.\\n\\nHe has the ability of invisibility, which he can use to become an invisible observer or to make himself or objects around him disappear from view. He has honed his skills to make himself undetectable, able to even make sounds vanish, allowing him to go unnoticed. His invisibility power is his greatest asset, and he uses it to protect those he cares about. END\"}\n{\"prompt\":\"18, man, invisibility ->\",\"completion\":\" \\n\\n18 year-old Jackson is a powerful young man with the incredible power of invisibility. He stands at 6'2 and has a strong athletic frame with wavy brown hair, startling blue eyes and a warm and gentle smile. His strength and agility make him especially good at using his ability. He can become invisible in an instant, moving through walls and other obstacles without being detected. What's more, he can move objects with his mind and use his power to protect those he loves. His power is a blessing and a curse, as it can be abused to do harm. Jackson is a brave and noble person who uses his power to do good and make the world a better place. END\"}\n(...)\n```", "```py\nimport os\nimport openai\n\nopenai.api_key = os.getenv(\"OPENAI_API_KEY\")\n\nresponse = openai.Completion.create(\n  model=\"davinci:ft-klhm:superhero-2023-02-01-14-56-48\",\n  prompt=\"18, Man, can eat a lot ->\\n\",\n  temperature=0.7,\n  max_tokens=256,\n  top_p=1,\n  frequency_penalty=0,\n  presence_penalty=0,\n  stop=[\"END\"]\n)\n```"]