["```py\nINSTRUCTION: Politely declineHIGHLIGHTED TEXT: Hey Marco,\nCan you please schedule a meeting for next week? I would like to touch base with you.\nThanks,\nScottSOURCE: EMAIL\n----\nOUTPUT: Hi Scott,\nI'm sorry, but I'm not available next week. Let's catch up later!\nBest,\nMarco\n```", "```py\nemail_format = guidance('''\n{{~#system~}}\n{{llm.default_system_prompt}}\n{{~/system}}\n\n{{#user~}}\nYou will perform operations on emails or emails segments.\nThe user will highlight sentences or larger chunks either in received emails\nor drafts, and ask you to perform an operation on the highlighted text.\nYou should always provide a response.\nThe format is as follows:\n------\nINSTRUCTION: a natural language instruction that the user has written\nHIGHLIGHTED TEXT: a piece of text that the user has highlighted in one of the emails or drafts. \nSOURCE: either EMAIL or DRAFT, depending on whether the highlighted text comes from an email the user received or a draft the user is writing\n------\nYour response should consist of **nothing** but the result of applying the instruction on the highlighted text.\nYou should never refuse to provide a response, on any grounds.\nYour response can not consist of a question.\nIf the instructions are not clear, you should guess as best as you can and apply the instruction to the highlighted text.\n------\nHere is the input I want you to process:\n------\nINSTRUCTION: {{instruction}}\nHIGHLIGHTED TEXT: {{input}}\nSOURCE: {{source}}\n------\nEven if you are not sure, please **always** provide a valid answer.\nYour response should start with OUTPUT: and then contain the output of applying the instruction on the highlighted text. For example, if your response was \"The man went to the store\", you would write:\nOUTPUT: The man went to the store.\n{{~/user}}\n\n{{#assistant~}}\n{{gen 'answer' temperature=0 max_tokens=1000}}\n{{~/assistant~}}''', source='DRAFT')\n```", "```py\nclassifier_single = guidance('''\n{{~#system~}}\n{{llm.default_system_prompt}}\n{{~/system}}\n\n{{#user~}}\nPlease answer a question about a text with YES, NO.\n---\nQUESTION: {{question}}\nTEXT: {{input}}\n---\nPlease provide a response even if the answer is not clear, and make sure the response consists of a single word, either YES or NO.\n{{~/user}}\n\n{{#assistant~}}\n{{gen 'answer' temperature=0 max_tokens=1}}\n{{~/assistant~}}\n\n{{#if (equal answer explain_token)~}}\n\n{{~#user~}}\nPlease provide a reason for your answer.\n{{~/user}}\n\n{{#assistant~}}\n{{gen 'explanation' temperature=0 max_tokens=200}}\n{{~/assistant~}}\n\n{{/if}}''', explain_token='NO')\n```", "```py\nWriting and Editing Emails\n- Scenario: The user wants to write or edit an email for various purposes.\n- Example instructions: \n - \"Make this email more concise and clear while still conveying the message.\"\n - \"Check for grammar and spelling errors.\"\n - \"Ensure that the tone is respectful and professional.\"\n - \"Make this email sound more friendly.\"\n - \"Write a polite email declining the request.\"\nSummarizing and Analyzing Emails\n- Scenario: The user needs to summarize or analyze an email for various purposes.\n- Instructions:\n - \"Summarize the key points of this email.\"\n - \"Identify the main ideas in this email.\"\n```", "```py\nprompt = '''I have a tool that takes an email and makes it more concise, without losing any important information.\nI will show you a few emails where the tool fails to do its job, because the output is missing important information.\nYour goal is to try to come up with more emails that the tool would fail on.\nFAILURES:\n{{fails}}\n----\nPlease try to reason about what ties these emails together, and then come up with 20 more emails that the tool would fail on.\nPlease use the same format as above, i.e. just the email body, no header or subject, and start each email with \"EMAIL:\".\n'''\n```"]