["```py\nsentences = [\"I have been using this product for a long time. Somehow the \n             product I received this time seems to be a fake one. It's \n             very thick and the smell is very chemical.\",\n             \"A good book for for dog owners. The book dosen't just \n             focus on dog training itself, but also on nutrition and care. \n             The book contains all the information needed for beginner dog \n             owners.\",\n             \"This lamp was better than I expected when it comes to its \n             quality. Nonetheless, the colours are not exactly as \n             displayed and it does not really fit with the curtains that I \n             purchased recently. Therefore I give this 3 out of 5 stars.\"]\n```", "```py\nprompt = f\"What is the sentiment of each of these reviews: {sentences}. \n         Output should be in a python list.\"\n```", "```py\n\"['negative', 'positive', 'positive']\"\n```", "```py\n\"The sentiment of each of these reviews is:\n1\\. Negative\n2\\. Positive\n3\\. Positive\"\n```", "```py\ndiscount_code = \"2023-promo\"\n\nprompt = f\"Can you write 2-3 sentences that can be displayed on an \n         e-commerce webpage if someone first visits it? It should contain \n         the code '{discount_code}' which gives the customer 20% discount \n         on their first purchase.\"\n```", "```py\n\"**Introducing our 20% off first purchase offer!**\n\nUse the code **2023-promo** at checkout to save 20% on your first \npurchase. This offer is valid for a limited time only, so don't miss out!\n\n**Shop now and start saving!**\"\n```", "```py\n\"**20% OFF YOUR FIRST PURCHASE**\n\nUse code 2023-promo at checkout to save 20% on your first purchase from \nour store. This offer is valid for new customers only and expires on \nMarch 31, 2023.\n\n**Shop now and save big!**\"\n```", "```py\ncontext = \"You're a customer assistance bot for an online gardening store \n          called GardenWorld and you want to help customers. You give \n          advice around gardening best practices, plant and flower types. \n          Always welcome the customer by telling them to subscribe to \n          the GardenWorld newsletter to get a 10% discount on their first \n          purchase.\"\n\nexamples = [{\n           \"input\": {\"content\": \"Hi!\"},\n           \"output\": {\"content\": \"Hoowdy gardener! 🌱\"}},\n           {\n           \"input\": {\"content\": \"Hello\"},\n           \"output\": {\"content\": \"Hoowdy gardener! 🌱\"}\n           },\n           {\n           \"input\": {\"content\": \"Why should I choose GardenWorld?\"},\n           \"output\": {\"content\": \"GardenWorld has been the award winning \n                                 supplier for best quality plants and \n                                 gardening equipment. With over 25 years \n                                 of experience, we continuously provide \n                                 the best in class service to our \n                                 customers.\"}}\n           ]\n```", "```py\nmessages = [{\n          \"author\": \"user\",\n          \"content\": \"Hi!\",\n           }]\n```", "```py\n\"Hoowdy gardener! 🌱 How can I help you today? Don’t forget to subscribe \nto the GardenWorld newsletter to get a 10% discount on your first \npurchase!\"\n```", "```py\n[{\"author\": \"user\", \n  \"content\": \"Hi!\" },\n {\"author\": \"1\"\n  \"content\": \"Hoowdy gardener! 🌱 How can I help you today? Don’t forget \n             to subscribe to the GardenWorld newsletter to get a 10% \n             discount on your first purchase!\" },\n {\"author\": \"user\",\n  \"content\": \"I need a nice houseplant that is easy to take care of. What \n             can you recommend?\" }]\n```", "```py\n\"A snake plant is a great choice for a houseplant because it is very low \nmaintenance and can thrive in a variety of conditions. They are also very \ntolerant of neglect, so they are perfect for people who are busy or \nforgetful.\"\n```", "```py\n\"Sure! We offer a 10% discount to all first time customers who subscribe \nto our newsletter. A ZZ plant is another great option for a low-\nmaintenance houseplant. They are also very tolerant of neglect and can \nthrive in a variety of conditions.'\n```"]