["```py\nFinal Answer: \nThe Pandavas' decision to live in the forest for 12 years \nwas primarily due to the circumstances and events that \nunfolded in their lives. After losing a game of dice to \nThe Kauravas and the Pandavas were forced into exile for \n13 years, with the last year to be spent incognito. \nDuring their exile, they faced numerous challenges \nand hardships, including living in the forest.\n\nBhima contemplated killing all of \nthe Kurus, but his brother Yudhisthira always \npacified him, stating that it was not the opportune \ntime to fulfil their desires. \nThus, living in the forest allowed them to avoid \nconfrontations and maintain peace.\n\nDuring their time in the forest, the Pandavas faced several difficulties. \nOne of the main challenges was Bhima's struggle to tolerate the ascetic \nlife. He contemplated killing all of the Kurus, but his brother \nYudhisthira always pacified him and advised against it. \nAdditionally, the Pandavas had to live in the forest and depend \non begging for their sustenance since their kingdom had been \nplundered in gambling. They were distressed by the loss of their \nkingdom and the insults to their queen Draupadi. The forest itself \nwas also full of dangers, adding to their hardships. Furthermore, \nthe Pandavas felt unable to fulfil the needs of certain pious Brahmanas \nwho stayed with them in the forest, as they did not possess anything \nand were dependent on begging for their own survival.\n\nDespite these challenges, the Pandavas made the most of their time \nin the forest. They received knowledge from sages and saintly persons, \nwhich helped them gain wisdom and spiritual insights. The great sage \nVyasa informed them that many generals had agreed to support their \ncousin Duryodhana, including Karna, Shakuni, Bhurishravas, Sala, \nDrona, and Bhishma. Vyasa also told Arjuna that if he were to fight \nin a future war, he would need to obtain the divine astras of Lord \nIndra and Lord Shiva.\n\nIn light of this information, Yudhisthira ordered Arjuna to go to the \nHimalayan mountains to perform austerities to please Lord Shiva. \nThis was necessary for Arjuna to obtain the divine weapons that would \nbe crucial in the upcoming war. The Pandavas understood the importance \nof being prepared and gathering the necessary resources to counter \nthe strength of their opponents. Therefore, Yudhisthira made the \ndecision to send Arjuna on this mission to seek Lord Shiva's blessings \nand acquire the divine astras.\n\nOverall, the Pandavas' exile in the forest for twelve years was a \nresult of the conditions imposed on them after losing the game \nof dice. They faced various difficulties during their time in the \nforest, but also gained valuable knowledge and prepared themselves \nfor the challenges that lay ahead.\n```", "```py\n** Unanswered Questions **\n'4\\. How did the Pandavas receive knowledge from sages and saintly persons during their time in the forest?'\n'5\\. What were the specific austerities that Arjuna had to perform in the Himalayan mountains to please Lord Shiva?'\n'6\\. How did the Pandavas manage to hide from Duryodhana's spies for almost the entire thirteenth year of their exile?'\n'8\\. How did Bhima cope with the challenges of living as an ascetic in the forest? Did he face any particular difficulties or struggles during their time in exile?'\n'9\\. Can you provide more information about the generals who supported Duryodhana's cause? What were their roles and contributions in the Kurukshetra war?'\n'10\\. How did the Pandavas manage to maintain a peaceful life in the forest despite the challenges they faced?'\n'11\\. What were the specific teachings and knowledge that the Pandavas received from the sages and saintly persons during their time in the forest?'\n'12\\. Can you provide more information about the palace where the Pandavas lived for one full year before going to the forest?'\n'13\\. How did Lord Krishna's presence in the forest affect the Pandavas' experience during their exile?'\n'14\\. Can you provide more information about the dangers the Pandavas faced while living in the forest?'\n'15\\. What were the specific challenges and difficulties that Yudhisthira and his brothers faced in their daily lives as inhabitants of the forest?'\n```"]