["```py\n!pip install evaluate --quiet\n!pip install rouge_score --quiet\n!pip install importlib-metadata --quiet\n!pip install datasets==2.10.1 --quiet \n!pip install git+https://github.com/google-research/bleurt.git --quiet\n!pip install sacrebleu --quiet\n!pip --no-cache-dir install bert_score==0.3.9 --quiet\n!pip install sacremoses --quiet\n!pip install jiwer==2.5.1 --quiet\n!pip install Cython \n\nimport evaluate\n\n# If you have a translation and reference corpus:\npredictions = [\"In Dungeons & Dragons, the metallic dragons come in brass, bronze, copper, gold, and silver varieties. Each has scales in hues matching their name - brass dragons have brassy scales, bronze have bronze scales, etc. The metallic dragons are generally more benign than the chromatic dragons in D&D lore.\"]\n\nreferences =[\"\"\"The five basic chromatic dragons (red, blue, green, black, and white) and metallic dragons (copper, brass, silver, gold, and bronze) appeared in the fifth edition Monster Manual (2014) in wyrmling, young, adult, and ancient. Gem dragons and other new-to-fifth-edition dragons appeared in Fizban's Treasury of Dragons (2021)\"\"\"]\n```", "```py\n#predictions (list): list of predictions to score. Each prediction should be a string with tokens separated by spaces.\n#references (list or list[list]): list of reference for each prediction or a list of several references per prediction. Each reference should be a string with tokens separated by spaces.\n#rouge_types (list): A list of rouge types to calculate. Defaults to ['rouge1', 'rouge2', 'rougeL', 'rougeLsum'].\n#Valid rouge types:\n##\"rouge1\": unigram (1-gram) based scoring\n##\"rouge2\": bigram (2-gram) based scoring\n##\"rougeL\": Longest common subsequence based scoring.\n##\"rougeLSum\": splits text using \"\\n\"\n#use_aggregator (boolean): If True, returns aggregates. Defaults to True.\n#use_stemmer (boolean): If True, uses Porter stemmer to strip word suffixes. Defaults to False.\n\nrouge = evaluate.load('rouge')\n\nresults = rouge.compute(predictions=predictions, references=references, use_aggregator=False)\nprint(results)\n```", "```py\n{\n'rouge1': [0.3636363636363636], \n'rouge2': [0.06185567010309278], \n'rougeL': [0.22222222222222224], \n'rougeLsum': [0.22222222222222224]\n}\n```", "```py\n#predictions (list of strs): Translations to score.\n#references (list of lists of strs): references for each translation.\n#max_order (int): Maximum n-gram order to use when computing BLEU score. Defaults to 4.\n#smooth (boolean): Whether or not to apply Lin et al. 2004 smoothing. Defaults to False.\n\n#bleu (float): bleu score\n#precisions (list of floats): geometric mean of n-gram precisions,\n#brevity_penalty (float): brevity penalty,\n#length_ratio (float): ratio of lengths,\n#translation_length (int): translation_length,\n#reference_length (int): reference_length\n\nbleu = evaluate.load(“bleu”)\n\nresults = bleu.compute(predictions=predictions, references=references,max_order=4)\nprint(results)\n```", "```py\n{\n'bleu': 0.07342349837092484, \n'precisions': [0.4262295081967213, 0.11666666666666667, 0.03389830508474576, 0.017241379310344827], \n'brevity_penalty': 1.0, \n'length_ratio': 20.333333333333332, \n'translation_length': 61, \n'reference_length': 3\n}\n```", "```py\n#output is always a number between 0 and (approximately 1). \n#This value indicates how similar the generated text is to the reference texts, with values closer to 1 representing more similar texts.\n\nbleurt = evaluate.load(\"bleurt\", module_type=\"metric\")\nresults = bleurt.compute(predictions=predictions, references=references)\n\nprint(results)\n```", "```py\n{\n'scores': [0.6028875708580017]\n}\n```", "```py\n#predictions: a list of predictions to score. Each prediction should be a string with tokens separated by spaces.\n#references: a list of references (in the case of one reference per prediction), or a list of lists of references (in the case of multiple references per prediction. Each reference should be a string with tokens separated by spaces.\n#alpha: Parameter for controlling relative weights of precision and recall. The default value is 0.9.\n#beta: Parameter for controlling shape of penalty as a function of fragmentation. The default value is 3.\n#gamma: The relative weight assigned to fragmentation penalty. The default is 0.5.\n\n#outputs 0-1 - .317 is acceptable score\nmeteor = evaluate.load('meteor')\nresults = meteor.compute(predictions=predictions, references=references)\n\nprint(results)\n```", "```py\n{\n'meteor': 0.19316493313521543\n}\n```", "```py\nprompt_data = \"\"\"\nHuman: \nYou are to rate a summarization on the scale of 0-10, with 0 being completely incorrect and 10 being a perfect summzarization of the given text.\nExplain why you give your score.\nGive a bullet point list of major differences between the reference and the summary.\nI will supply a reference text by denoting REF: and the summarization to compare against with SUMMARY:.\n\nREF:\nThe five basic chromatic dragons (red, blue, green, black, and white) \nand metallic dragons (copper, brass, silver, gold, and bronze) \nappeared in the fifth edition Monster Manual (2014) in wyrmling, young, adult, and ancient. \nGem dragons and other new-to-fifth-edition dragons appeared in Fizban's Treasury of Dragons (2021)\n\nSUMMARY:\nIn Dungeons & Dragons, the metallic dragons come in brass, bronze, copper, gold, and silver varieties. \nEach has scales in hues matching their name - brass dragons have brassy scales, bronze have bronze scales, etc. \nThe metallic dragons are generally more benign than the chromatic dragons in D&D lore.\n\nAssistant:\"\"\"\n```", "```py\n Score: 5/10\n\nExplanation:\n\nThe summary captures some accurate high-level information about metallic dragons in D&D, such as listing the main types and noting their more benign nature compared to chromatic dragons. However, it leaves out a lot of key details from the reference text:\n\n- Does not mention the chromatic dragons (red, blue, green, black, white) that were described.\n- Does not mention the different age categories (wyrmling, young, adult, ancient).\n- Does not mention the Monster Manual or Fizban's Treasury of Dragons sourcebooks.\n- Only focuses on metallic dragons, while the reference text had information about both metallic and chromatic dragons.\n\nMajor differences:\n\n- No mention of chromatic dragons\n- No mention of dragon age categories\n- No mention of Monster Manual or Fizban's Treasury of Dragons\n- Only discusses metallic dragons, not full scope of reference text\n- Does not convey the introduction timeline of dragons across 5th edition books\n```"]