["```py\nSUMMARY\n**I. LLMs with LangChain for Supply Chain Analytics**\nAn exploration of how LangChain and LLMs can revolutionize analytics \nin supply chain management.\n**1\\. Scenario: Distribution Process of a Fashion Retailer**\nThe complex distribution operations in a global fashion retail setting.\n**2\\. Setting the Stage for Experimentation**\nIntroduce the experimental setup to test a LangChain SQL agent. \n**3\\. Experimental Protocol: Starting Simple**\nStart with a straightforward query to assess the agent's basic capabilities.\n**II. Experiments and Key Insights**\n**1\\. Test 1**\nSimple Prompt without Template\n2\\. Test 2\nPrompt Template with a Context\n**3\\. Test 3**\nPrompt Template with an Improved Context\n**4\\. Test 4**\nAdvanced Analysis with an Improved Context\n**5\\. Final Test**\nCreate a Chain to Write an Email Report\n**III. LLMs Shaping the Future of Supply Chain**\n**1\\. What about GPTs? \"The Supply Chain Analyst\" Agent**\nI tried the new feature \"GPTs\" of ChatGPT with \"The Supply Chain Analyt\" Agent\n**2\\. A Simple 'Proof-of-Concept'**\nWe can use an agent to track shipments with TMS data\n**3\\. Continuing the Prototype Development**\nChallenge the agent with complex analyses and more tables.\n**4\\. Exploring Broader Applications in Supply Chain**\nLLMs can boost the user experience for Digital Twins, Network Optimization,\nBusiness Intelligence, ESG Reporting and many other applications\n```", "```py\ncontext_explanation = \"\"\"\nAs a supply chain control tower manager, my role involves overseeing the logistics network and ensuring that shipments are processed efficiently and delivered on time. \nThe 'shipments' table in our database is crucial for monitoring these processes. It contains several columns that track the progress and timeliness of each shipment throughout various stages:\n- 'Order_Date' and 'Expected_Loading_Date' provide timestamps for when an order was placed and when it was expected to be loaded for departure.\n- 'Expected_Delivery_Time' is a timpestamp defining when the shipment is expected to be delivered\n- 'Loading_OnTime', 'Airport_OnTime', 'Landing_OnTime', 'Transmission_OnTime' are boolean values indicating whether the shipment was processed on time at various stages. If any of these are False, it implies a delay occurred, potentially causing the shipment to miss its cut-off time and be postponed to the next day.\n- 'Store_Open' indicates if the truck arrived at the store before closing time. A False value here means the delivery must wait until the next day.\n- 'On_Time_Delivery' is a critical indicator of our service level, showing whether a shipment arrived by the requested delivery time.\nUnderstanding the data in these columns helps us identify bottlenecks in the shipment process and take corrective actions to improve our delivery performance.\n\"\"\"\ninput_question = \"How many shipments were delayed in the first seven days of May?\"\n```"]