["```py\nJennifer purchased 40 cans of milk at the store before meeting her \nclassmate Mark, who was also buying milk. Jennifer bought 6 additional \ncans for every 5 cans Mark bought. If Mark purchased 50 cans, how many \ncans of milk did Jennifer bring home from the store?\n```", "```py\nQ: {{ question }}\nA:\n```", "```py\n Jennifer brought home 76 cans of milk from the store.\n```", "```py\nQ: Ken created a care package to send to his brother, who was away at boarding school. Ken placed a box on a scale, and then he poured into the box enough jelly beans to bring the weight to 2 pounds. Then, he added enough brownies to cause the weight to triple. Next, he added another 2 pounds of jelly beans. And finally, he added enough gummy worms to double the weight once again. What was the final weight of the box of goodies, in pounds?\nA: 16\n\nQ: Mark has a garden with flowers. He planted plants of three different colors in it. Ten of them are yellow, and there are 80% more of those in purple. There are only 25% as many green flowers as there are yellow and purple flowers. How many flowers does Mark have in his garden?\nA: 35 \n\nQ: James writes a 3-page letter to 2 different friends twice a week. How many pages does he write a year? \nA: 624 \n\nQ: Albert is wondering how much pizza he can eat in one day. He buys 2 large pizzas and 2 small pizzas. A large pizza has 16 slices and a small pizza has 8 slices. If he eats it all, how many pieces does he eat that day?\nA: 48\n\nQ: Betty is saving money for a new wallet which costs $100\\. Betty has only half of the money she needs. Her parents decided to give her $15 for that purpose, and her grandparents twice as much as her parents. How much more money does Betty need to buy the wallet?\nA: 5\n\nQ: {{ question }}\nA:\n```", "```py\n76\n```", "```py\nQ: James writes a 3-page letter to 2 different friends twice a week. How many pages does he write a year? \nA: He writes each friend 3*2=6 pages a week So he writes 6*2=12 pages every week That means he writes 12*52=624 pages a year. The answer is 624.\n\nQ: {{ question }}\nA:\n```", "```py\n Jennifer bought 40+6/5*50=40+12*10=40+120=160 cans of milk. The answer is 160.\n```", "```py\nQ: Mark has a garden with flowers. He planted plants of three different colors in it. Ten of them are yellow, and there are 80% more of those in purple. There are only 25% as many green flowers as there are yellow and purple flowers. How many flowers does Mark have in his garden?\nA: There are 80/100*10=8 more purple flowers than yellow flowers. So in Mark's garden, there are 10+8=18 purple flowers. Purple and yellow flowers sum up to 10+18=28 flowers. That means in Mark's garden there are 25/100*28=7 green flowers. So in total Mark has 28+7=35 plants in his garden. The answer is 35.\n\nQ: {{ question }}\nA:\n```", "```py\n For every 5 cans Mark bought, Jennifer bought 6 additional cans. So for 50 cans, Jennifer bought 6/5*50=60 additional cans. In total, Jennifer bought 40+60=100 cans of milk. Therefore, Jennifer brought home 100 cans of milk from the store.\n```", "```py\nQ: James writes a 3-page letter to 2 different friends twice a week. How many pages does he write a year? \nA: #James has\nnumber_of_friends=2\n\n#He writes each friend 3-page letter each time.\npage_letter_size=3\n\n#He writes twice to each friend in a week.\nnumber_of_times_written_to_friend=2\n\n#Total pages written in a week to each friend\npages_written_to_each_friend_per_week=page_letter_size*number_of_times_written_to_friend=6\n\n#So, total pages written by him per week,\ntotal_pages_each_week=pages_written_to_each_friend_per_week*number_of_friends=12\n\n#Number of weeks in a year\ntotal_weeks_in_a_year=52\n\n#That means he writes,\ntotal_pages_written_in_year=total_pages_each_week*total_weeks_in_a_year=624\n#pages per year.\n\nThe answer is 624.\n\nQ: {{ question }}\nA:\n```", "```py\n#Jennifer initially bought 40 cans of milk.\ninitial_cans_bought=40\n\n#For every 5 cans Mark bought, Jennifer bought 6 additional cans.\nadditional_cans_bought=6\nmark_cans_bought=50\n\n#So, for every 5 cans Mark bought, Jennifer bought 6 additional cans.\nadditional_cans_bought=6\nmark_cans_bought=50\n\n#Number of times Mark bought 5 cans\nnumber_of_times_mark_bought=mark_cans_bought/5=10\n\n#Total additional cans bought by Jennifer\ntotal_additional_cans_bought=additional_cans_bought*number_of_times_mark_bought=60\n\n#Total cans of milk brought home by Jennifer\ntotal_cans_brought_home=initial_cans_bought+total_additional_cans_bought=40+60=100\n\nThe answer is 100 cans of milk.\n```", "```py\nQ: {{ question }}\nA: Let's think step by step...\n```", "```py\n 1\\. Jennifer initially bought 40 cans of milk.\n2\\. For every 5 cans Mark bought, Jennifer bought 6 additional cans.\n3\\. Since Mark bought 50 cans, Jennifer bought 6 additional cans for every 5 cans, which means she bought (6/5) x 50 = 60 cans.\n4\\. Therefore, Jennifer brought home a total of 40 + 60 = 100 cans of milk from the store.\n```", "```py\nIdentify and behave as three different experts that are appropriate to answering this question.\nAll experts will write down the step and their thinking about the step, then share it with the group.\nThen, all experts will go on to the next step, etc.\nAt each step all experts will score their peers response between 1 and 5, 1 meaning it is highly unlikely, and 5 meaning it is highly likely.\nIf any expert is judged to be wrong at any point then they leave.\nAfter all experts have provided their analysis, you then analyze all 3 analyses and provide either the consensus solution or your best guess solution.\n\nFollowing is the question:\nQ: {{ question }}\nA:\n```", "```py\n Expert 1: Math Expert\nStep 1: Calculate the total number of cans of milk purchased by Mark.\nMark bought 50 cans of milk.\nScore: 5 (highly likely)\n\nStep 2: Calculate the number of cans of milk purchased by Jennifer before meeting Mark.\nJennifer purchased 40 cans of milk.\nScore: 5 (highly likely)\n\nStep 3: Calculate the number of additional cans of milk purchased by Jennifer for every 5 cans Mark bought.\nFor every 5 cans Mark bought, Jennifer bought 6 additional cans.\nScore: 5 (highly likely)\n\nStep 4: Calculate the total number of cans of milk purchased by Jennifer.\nJennifer bought 40 + (6/5)*50 = 40 + 60 = 100 cans of milk.\nScore: 5 (highly likely)\n\nStep 5: Conclusion\nJennifer brought home 100 cans of milk from the store.\nScore: 5 (highly likely)\n\nExpert 2: Retail Expert\nStep 1: Determine the average number of cans of milk purchased by customers at the store.\nBased on previous sales data, the average number of cans of milk purchased by customers is 10.\nScore: 4 (likely)\n\nStep 2: Calculate the total number of cans of milk purchased by Mark.\nMark bought 50 cans of milk.\nScore: 5 (highly likely)\n\nStep 3: Calculate the number of cans of milk purchased by Jennifer before meeting Mark.\nJennifer purchased 40 cans of milk.\nScore: 5 (highly likely)\n\nStep 4: Calculate the total number of cans of milk purchased by Jennifer.\nJennifer bought 40 + (6/5)*50 = 40 + 60 = 100 cans of milk.\nScore: 5 (highly likely)\n\nStep 5: Conclusion\nJennifer brought home 100 cans of milk from the store.\nScore: 5 (highly likely)\n\nExpert 3: Psychology Expert\nStep 1: Analyze Jennifer's behavior and decision-making process.\nJennifer may have purchased 40 cans of milk based on her own needs and preferences.\nScore: 4 (likely)\n\nStep 2: Analyze Mark's behavior and decision-making process.\nMark may have purchased 50 cans of milk based on his own needs and preferences.\nScore: 4 (likely)\n\nStep 3: Consider the influence of social norms and peer pressure.\nJennifer may have felt pressured to buy more cans of milk after seeing Mark's purchase.\nScore: 3 (somewhat likely)\n\nStep 4: Analyze the impact of Jennifer's decision to buy additional cans for every 5 cans Mark bought.\nJennifer may have made this decision based on a desire to keep up with Mark or to appear generous.\nScore: 3 (somewhat likely)\n\nStep 5: Conclusion\nJennifer brought home 100 cans of milk from the store, possibly influenced by social norms and peer pressure.\nScore: 3 (somewhat likely)\n\nConsensus Solution:\nBased on the analysis of all three experts, it is highly likely that Jennifer brought home 100 cans of milk from the store. The math expert's analysis provides a solid calculation, while the retail expert's analysis takes into account the average number of cans purchased by customers. The psychology expert's analysis adds a different perspective by considering the influence of social norms and peer pressure. Overall, the consensus solution is that Jennifer brought home 100 cans of milk from the store.\n```", "```py\n### INSTRUCTION ###\nYou are required to answer Arithmetic Reasoning questions. Please follow the steps below as you go about solving the problem. \n\n1\\. All problems should be solved in as many steps as required and each step should be numbered.\n2\\. All calculations should be clear and simple to understand.\n3\\. Provide an accurate final answer at the end of your reasoning in the following format: 'Answer is '.\n\nYou'll be evaluated on:\n- how easier are the calculations done to understand?\n- how accurate is the answer?\n\n### INPUT DATA ###\nQ: {{ question }}\nA:\n```", "```py\n1\\. Jennifer bought 40 cans of milk at the store.\n2\\. Mark bought 50 cans of milk.\n3\\. Jennifer bought 6 additional cans for every 5 cans Mark bought.\n4\\. For every 5 cans Mark bought, Jennifer bought 6 additional cans.\n5\\. Therefore, for 50 cans Mark bought, Jennifer bought (6/5)*50 = 60 additional cans.\n6\\. Total cans of milk Jennifer bought = 40 + 60 = 100 cans.\nAnswer is 100 cans.\n```"]